[
  {
    "type": "snippet",
    "category": "<SWORD_SOUNDS>",
    "text": [ "Whoosh!", "Whirr!", "Swoop!", "Hiss!", "Fssst!", "Shaaa!", "Shing!", "Zip!", "Shrk!", "Heng!", "Zheng!" ]
  },
  {
    "type": "snippet",
    "category": "<SWORD_HIT_MESSAGES>",
    "text": [
      "You strike the lower regions with a resounding <SWORD_SOUNDS>",
      "<SWORD_SOUNDS> You attack the center of mass!",
      "Weaving you slam into your target, <SWORD_SOUNDS>",
      "Feinting high <SWORD_SOUNDS> You visciously smash the midsection.",
      "With a half spin you coil your energy and unleash it with a twist of the hips <SWORD_SOUNDS>",
      "You spread out low to the ground, your chest nearly touching the floor only to suddenly whip up <SWORD_SOUNDS>",
      "<SWORD_SOUNDS> You dodge midair with your legs spread apart while you strike downwards!"
    ]
  },
  {
    "type": "snippet",
    "category": "<SWORD_HIT_MULTIPLE_MESSAGES>",
    "text": [
      "Your blade passes through your opponents with a soft <SWORD_SOUNDS>",
      "The blade sings as you circle it around you.",
      "<SWORD_SOUNDS> Nothing but a cold flash as you strike once around yourself.",
      "Single cut, yet many struck.",
      "With a spinning slash your opponents are throw into disarray.",
      "Steel falls like rain, and none could escape its reach."
    ]
  },
  {
    "type": "snippet",
    "category": "<HUA_CIRCULAR_SWORD_MESSAGES>",
    "text": [
      "Shoulders relaxed, arms outstreched, you swing in a powerful wide arc. <SWORD_SOUNDS>",
      "Your sword flashes in a smooth sweeping arc, striking every enemy in front as feathers of killing intent scatter on the wind.",
      "You extend both arms releasing a wide slash.",
      "The blade glides outward as if borne by wind, striking everyone in front."
    ]
  },
  {
    "type": "snippet",
    "category": "<FALLING_STAR_SCATTERS_THE_FLOCK_MESSAGES>",
    "text": [
      "Like a star hurling across the sky, you leap.\n<SWORD_HIT_MULTIPLE_MESSAGES>",
      "Descending in a blur of steel, you land amid the enemy as your blade whirls, striking all around.",
      "Like a meteor plunging from the heavens, you close the distance in a single bound, your sword flashing in a circular sweep.",
      "You fall from the sky striking the earth, landing at the enemy, blade flashing in a radiant ring."
    ]
  }
]
