[
  {
    "type": "snippet",
    "category": "<FLYING_SILK_SEVERING_BLADE_MESSAGES>",
    "text": [
      "A thin thread binds blade to wielder, knife dancing through the air, before the string snaps.",
      "Thread blazing as blade spirals.",
      "The blade rides a thread, shredding the strands."
    ]
  },
  {
    "type": "snippet",
    "category": "<SOLAR_LOTUS_BURST_MESSAGES>",
    "text": [
      "Gathering blazing qi into a seal, it blooms in a radiant explosion that incinerates everything within its heart.",
      "By compressing qi to its limit, you form a glowing lotus that detonates in a violent bloom, leaving only ash when it opens.",
      "What blooms is not life, but destruction. A lotus born of qi, ending in a thunderous burst.",
      "A silent lotus of beautiful light appears, floating for a breath only to bursts apart in a roaring eruption."
    ]
  },
  {
    "type": "snippet",
    "category": "<FROZEN_SOUL_SHARD_MESSAGES>",
    "text": [
      "You breathe out sharply, freezing the water into icy shards.",
      "Exhaling a breath of killing frost, you release jagged shards of soul ice that pierce the flesh.",
      "The air screams as icy shards tear through it.",
      "Ice shards bloom forward like deadly snowflakes, striking with silent precision and an unforgiving chill."
    ]
  },
  {
    "type": "snippet",
    "category": "<NEEDLE_OF_HEAVENS_SPARK_MESSAGES>",
    "text": [
      "You flick out a piece of metal, and connect a bolt of lightning between it and your finger.",
      "Thunder locks onto the thrown coin, drawing a bolt that strikes faster than thought.",
      "A coin is flicked through the air, and a bolt of lightning descends upon it, turning metal into a divine needle of judgment.",
      "With a casual toss of a coin, lightning follows its path, striking the target as if guided by heaven itself."
    ]
  },
  {
    "type": "snippet",
    "category": "<MIST_OF_INTOXICATING_CLOUDS_MESSAGES>",
    "text": [
      "With a splash of alcohol and a surge of qi, a fragrant fog spreads, dulling minds and unsteadying steps.",
      "Clouds of alcohol laced mist spread outward, leaving enemies laughing, stumbling, or collapsing in stupor.",
      "Wine becomes mist, mist becomes poison, and the battlefield turns into a drunken dream."
    ]
  }
]
